openFOAM_3/mach-3-tunnel-with-step/rhoCentralFoam40/system/graph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cell;

setFormat       raw;

sets
(
    horizontal_wall 
    {
        type    lineCell;
        axis    xyz;
        start   (x1 y1 z1);
        end     (x2 y2 z2);
    }
);

fields          ( p U T );


// ************************************************************************* //
